{
  "tasks": [
    {
      "id": 1,
      "type": "University Project",
      "name": "Super Hero Game",
      "repolink": "https://github.com/CallumF15/IP3_2D_CF",
      "gamelink": "../SuperHeroGame/game.html",
      "image": "Images/flygame.jpg",
      "projectabout": {
        "desc": "The concept for the game was simple. Play as a superhero soaring through the sky whilst in the pursuit of an evil villain who is relentlessly targeting you whilst you collect coins and power-ups to aid you in your battle to defeat him.  ",
        "desc2": "A 2D superhero video game targeted towards children which utilizes the technology LeapMotion for hand gesture recognition to enable character movement. Initially the LeapMotion technology was used to enable hand gesture recognition to manipulate the character’s movement to fly at an angle that's based on the pitch of your hand. The idea of a kid playing with his superman-like action figure by grasping the figures legs and pretending he was soaring  through the sky spawned the idea for how the control scheme for the game would work. ",
        "instructions": "         <ol>             <li className='first'>               <h3> Objective </h3>               <p>                 Defeat the boss by reducing his health to 0 whilst using power-ups to assist you in your fight whilst dodging his attacks to survive and collecting all the coins you can to increase your score. \n               </p>             </li>               <li>               <h3> Controls </h3>               <ol>                 <li>                   <h4> Movement: </h4>                   <p>                     Use the mouse to steer the character in the direction you desire to move.                   </p>                 </li>                  <li>                   <h4> Shooting: </h4>                   <p>                     Use left click on your mouse to shoot a fireball.                   </p>                 </li>                </ol>             </li>               <li>               <h3> Collectibles</h3>                <ol>                 <li>                   <h4> Coins: </h4>                   <p> Increase your score by collecting the gold coins that appear as you fly! </p>                 </li>               </ol>             </li>              <li>               <h3> Power-ups: </h3>                <ol>                 <li>                   <h4> Shield: </h4>                   <p>                     temporarily makes you invulnerable to the boss’s attacks.                   </p>                 </li>                  <li>                   <h4> Heart: </h4>                   <p>                     Restores your health.                   </p>                 </li>                  <li>                   <h4> Green Gem: </h4> <p>  Not yet implemented but appears in-game.  </p> </li>   <li><h4> Purple Gem: </h4> <p>  Not yet implemented but appears in-game.</p> </li> </ol> </li> </ol>"
      },
      "projectdetails": {
        "team": "Artist, 3D modeller, Designer, Psychologist, Programmer",
        "targetAudience": "Children",
        "techUsed": "C#,Unity,LeapMotion"
      }
    },
    {
      "id": 2,
      "type": "University Project",
      "name": "Procedural Content Generation",
      "repolink": "",
      "gamelink": "",
      "image": "Images/PCG-game.jpg",
      "projectabout": {
        "desc": "A 2D game that utilizes a procedural content algorithm known as Perlin Noise to generate unique levels for the user each time. This was combined with collecting player data such as how often they perform certain actions and other data such as the number of times they die and how long it takes them to finish a level to determine how best to generate the next world for them. Play tests were conducted by myself to pull in user data from multiple participants allowing me to see how the terrain generator reacted to different users. A survey was carried out after each user’s playtest to assess whether they thought the levels generated for them reflected their play style. The data was then analysed, and adjustments were made to the algorithm to improve the terrain generation.",
        "desc2": "The game only has the basics of movement implemented to transverse the environment. Future goals for the project were to add in enemy placement systems, power-ups and collectibles that worked in tandem with the terrain generation and data-collection.",
        "instructions": ""
      },
      "projectdetails": {
        "team": "Programmer",
        "targetAudience": "All audiences",
        "techUsed": "C#, Unity"
      }
    },
    {
      "id": 3,
      "type": "Personal Project",
      "name": "Mobile Platformer",
      "repolink": "https://github.com/CallumF15/PlatformerGame",
      "gamelink": "",
      "image": "Images/PlatformerGame.jpg",
      "projectabout": {
        "desc": "A 2D endless jumping platformer game being designed for mobile devices where the user must time their jumps to land on the next platform, building up their score and seeing how far they can get before they miss a platform, and their current attempt ends.",
        "desc2": "The game generates a limited number of platforms for the user to jump on at a time and once the player has made so many successful jumps, the next set of platforms will be generated. The design choices for all the platforms would vary was and is still being considered. The platforms could either be all on the same height, or they could be stepped like a staircase going up or down whilst also enabling random modifiers to each platform. ",
        "instructions": ""
      },
      "projectdetails": {
        "team": "Programmer",
        "targetAudience": "All audiences",
        "techUsed": "C#, Unity"
      }
    },
    {
      "id": 4,
      "type": "Job Project",
      "name": "Website Test 19394949",
      "repolink": "",
      "gamelink": "",
      "image": "Images/flygame.jpg",
      "projectabout": {
        "desc": "A portfolio website bgko rog rgko kgdpokgop gkpkgop gdgk  ",
        "desc2": "",
        "instructions": ""
      },
      "projectdetails": {
        "team": "Programmer",
        "targetAudience": "All audiences",
        "techUsed": "C#, Unity"
      }
    }
  ]
}